let INSTRUCTIONS = [ 'โกวาจี ฉัน แตงไทย', 'โกวาจี ผม บี', 'โกวาจี ผม ตาล',
'โกวาจี ผม ฟร้องซ์', 'ล็อกอิน ผ่าน การ จำ เสียง', 'ล็อกอิน นาม บี',
'ล็อกอิน นาม ตาล', 'ล็อกอิน นาม แตงไทย', 'ล็อกอิน นาม ฟร้องซ์',
'ล็อกเอาท์', 'เข้า หน้า โฮมเพจ', 'เข้า หน้า ค้นหา', 'เข้า หน้า รายการ โปรด', 'เปิด หน้า รายการ โปรด', 'แสดง หน้า รายการ โปรด',
'แสดง โหมด ค้นหา', 'เปิด โหมด ค้นหา', 'เปิด โหมด หมายเลข หนึ่ง',
'เปิด โหมด หมายเลข สอง', 'เปิด โหมด หมายเลข สาม',
'เปิด โหมด หมายเลข สี่', 'เปิด โหมด หมายเลข ห้า',
'เลือก วิดีโอ หมายเลข หนึ่ง', 'เลือก วิดีโอ หมายเลข สอง',
'เลือก วิดีโอ หมายเลข สาม', 'เลือก วิดีโอ หมายเลข สี่',
'เลือก วิดีโอ หมายเลข ห้า', 'แสดง วิดีโอ อันดับ หนึ่ง ของ ฉัน',
'แสดง วิดีโอ อันดับ สอง ของ ฉัน', 'แสดง วิดีโอ อันดับ สาม ของ ฉัน',
'เล่น วิดีโอ ที่ แสดง', 'ปิด วิดีโอ ที่ แสดง',
'เล่น ต่อ จาก วิดีโอ เดิม',
'พอส วีดีโอ', 'เล่น วีดีโอ', 'หยุด วีดีโอ', 'ขยาย หน้าจอ',
'ย่อ หน้าจอ', 'เปิด ลูป', 'ปิด ลูป', 'เล่น ตอน ต่อไป',
'เล่น ตอน ที่แล้ว', 'เซ็ต ความเร็ว วีดีโอ หนึ่ง จุด สอง ห้า เท่า',
'เซ็ต ความเร็ว วีดีโอ หนึ่ง จุด ห้า เท่า',
'เซ็ต ความเร็ว วีดีโอ สอง เท่า',
'เซ็ต ความเร็ว วีดีโอ ศูนย์ จุด เจ็ด ห้า เท่า',
'เซ็ต ความเร็ว วีดีโอ ศูนย์ จุด ห้า เท่า',
'เพิ่ม ความเร็ว วีดีโอ สอง เท่า',
'เพิ่ม ความเร็ว วีดีโอ ศูนย์ จุด หนึ่ง',
'เพิ่ม ความเร็ว วีดีโอ ศูนย์ จุด สอง ห้า',
'เพิ่ม ความเร็ว วีดีโอ ศูนย์ จุด ห้า',
'เพิ่ม ความเร็ว วีดีโอ หนึ่ง', 'ลด ความเร็ว วีดีโอ สอง เท่า',
'ลด ความเร็ว วีดีโอ ศูนย์ จุด หนึ่ง',
'ลด ความเร็ว วีดีโอ ศูนย์ จุด สอง ห้า',
'ลด ความเร็ว วีดีโอ ศูนย์ จุด ห้า', 'ลด ความเร็ว วีดีโอ หนึ่ง',
'ย้อน วีดีโอ ไป หนึ่ง วินาที', 'ย้อน วีดีโอ ไป ห้า วินาที',
'ย้อน วีดีโอ ไป สิบ วินาที', 'ย้อน วีดีโอ ไป สิบ ห้า วินาที',
'ย้อน วีดีโอ ไป สาม สิบ วินาที', 'ย้อน วีดีโอ ไป หนึ่ง นาที',
'เลื่อน วีดีโอ ไป ห้า วินาที', 'เลื่อน วีดีโอ ไป สิบ วินาที',
'เลื่อน วีดีโอ ไป สิบ ห้า วินาที',
'เลื่อน วีดีโอ ไป สาม สิบ วินาที', 'เลื่อน วีดีโอ ไป หนึ่ง นาที',
'เล่น วีดีโอ ที่ เวลา ศูนย์ นาที', 'เล่น วีดิโอ ที่ กลาง ตอน',
'เล่น วีดิโอ ที่ หนึ่ง ใน สี่ ของ ตอน',
'เล่น วีดิโอ ที่ สาม ใน สี่ ของ ตอน', 'ปิด เสียง',
'ตั้งค่า เสียง ศูนย์ เปอร์เซนต์',
'ตั้งค่า เสียง ยี่ สิบ ห้า เปอร์เซนต์',
'ตั้งค่า เสียง ห้า สิบ เปอร์เซนต์',
'ตั้งค่า เสียง เจ็ด สิบ ห้า เปอร์เซนต์',
'ตั้งค่า เสียง ร้อย เปอร์เซนต์', 'เพิ่ม เสียง', 'ลด เสียง',
'ปรับ คุณภาพ วิดีโอ ระดับ ต่ำ', 'ปรับ คุณภาพ วิดีโอ ระดับ กลาง',
'ปรับ คุณภาพ วิดีโอ ระดับ สูง', 'ตั้ง เป็น รายการ โปรด','ตั้งค่า เป็น รายการ โปรด', 'ตั้ง วิดีโอ เป็น รายการ โปรด','ตั้งค่า วิดีโอ เป็น รายการ โปรด',
'เอา ออก จาก รายการ โปรด', 'ตั้ง เป็น วิดีโอ ทอป วัน',
'ตั้ง เป็น วิดีโอ ทอป ทู', 'ตั้ง เป็น วิดีโอ ทอป ทรี',
'แนะนำ หนัง หน่อย สิ โกวาจี', 'ขอ ชื่อ ผู้ อัพโหลด วีดีโอ',
'วิดีโอ ความยาว เท่าไหร่', 'ขอ ความยาว วิดีโอ', 'วิดีโอ ชื่อ อะไร',
'ขอ ชื่อ วิดีโอ']
let addedInstruction = []
const variousVideo = ['วิดีโอ','วีดีโอ','วีดิโอ']
INSTRUCTIONS.forEach((instruction)=> {
    if(instruction.includes(variousVideo[0]) && !addedInstruction.includes(instruction)) {
        const int1 = instruction.replace(variousVideo[0],variousVideo[1])
        const int2 = instruction.replace(variousVideo[0],variousVideo[2])
        INSTRUCTIONS.push(int1)
        INSTRUCTIONS.push(int2)
        addedInstruction.push(int1)
        addedInstruction.push(int2)
    } else if(instruction.includes(variousVideo[1]) && !addedInstruction.includes(instruction)) {
        const int1 = instruction.replace(variousVideo[1],variousVideo[0])
        const int2 = instruction.replace(variousVideo[1],variousVideo[2])
        INSTRUCTIONS.push(int1)
        INSTRUCTIONS.push(int2)
        addedInstruction.push(int1)
        addedInstruction.push(int2)
    } else if(instruction.includes(variousVideo[2]) && !addedInstruction.includes(instruction)) {
        const int1 = instruction.replace(variousVideo[2],variousVideo[0])
        const int2 = instruction.replace(variousVideo[2],variousVideo[1])
        INSTRUCTIONS.push(int1)
        INSTRUCTIONS.push(int2)
        addedInstruction.push(int1)
        addedInstruction.push(int2)
    }
})
INSTRUCTIONS.sort()
// //console.log(INSTRUCTIONS)
export default INSTRUCTIONS;